IDEA Open Model
CountryCode Enumeration
 CountryCode
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public enum CountryCode
Public Enumeration CountryCode
public enum class CountryCode
Members
Member name | Value | Description
None | 0 |  no code
ECEN | 1 |  Eurocode
SIA | 6 |  Swiss code
American | 8 |  American design code as ACI, AISC, ASTM standards etc.
Canada | 9 |  Canadian design code
Australia | 10 |  Australian design code
RUS | 11 |  Russia design code
See Also
Reference
IdeaRS.OpenModel Namespace